<script setup>
/**
 * defineProps and defineEmits - 'это макросы компилятора, доступные без всяких импортов в скрипте setup.
 *
 * Макрос — это ряд команд, которые можно использовать для автоматизации повторяющихся задач
 * и запускать при выполнении задачи. Макросы служат для автоматизации часто выполняемых задач,
 * что позволяет сэкономить время за счет сокращения объема работы с клавиатурой и мышью.
 *
 * есть парочка тонкостей с ними: они попадают сразу в module scope
 * и потому если пытаться при их описании использовать локальные переменные объявленные
 * в setup nо ты словишь ошибку компиляции
 */
</script>